#عددی که میخواهیم جذر آن را محاسبه کنیم دخیره میکنیم در a0
#جذر عدد ورودی در نهایت دخیره میشود در a0
#اگر جذر عدد ورودی،صحیح نباشد(اعشاری باشد)،کد عدد نهایی را رو به بالا گرد میکند(برای مثال جذر عدد ده که سه و خورده ای است،میشود چهار در این کد)
#جذر اعداد صحیح دقیق محاسبه میشود




li a0, 16    #محاسبه جذر عدد شانزده
sqrt:
    #ذخیره مقادیر موقت در رجیسترهای t0 و t1
    li t0, 0  #نتیجه جذر را در t0 ذخیره میکنیم
    li t1, 1  #اندازه گام را در t1 ذخیره میکنیم

    #شروع حلقه محاسبه جذر
loop:
    mul t2,t0,t0     #محاسبه مربع نتیجه فعلی در t2
    add t0,t0,t1     #افزایش نتیجه فعلی با اندازه گام
    bge t2,a0,end   #اگر مربع نتیجه از ورودی بزرگتر شد،حلقه را متوقف کن
    j loop  #ادامه حلقه

end:
    addi t0,t0,-1  #کاهش نتیجه فعلی به 1 واحد کمتر برای محاسبه جذر دقیق
    mv a0,t0  #انتقال نتیجه محاسبه شده به رجیستر خروجی a0
    ret  #بازگشت از تابع



